# **Руководство пользователя**
## *Основные команды*
* **git init** Создание репозитория в новой папке

* **git add имя файла** Начать отслеживать файл. Для выбора имени файла можно использовать **TAB**

* **git diff** Просмотреть различия между уже сохраненным версиями

* **git log** Просмотр существующих коммитов

* **git commit -m"комментарий"** Добавить коммит. Перед этим применить комманду **git add**

* **git checkout номер коммита** Вернуться к определенному коммиту

* **git checkout master** Вернуться в последнее актуальное состояние

## *Дополнительные команды*
* **git clear** Очистить поле терминала

* **git version** Посмотреть версию Git: проверить, видит ли VS Code

* **git config --global user.name «Ваше имя английскими буквами»** Зарегистрироваться под именем
Выход
* **git config --global user.email ваша почта@example.com** Зарегистироваться с почтой

* **Q**  из меню в основное поле терминаала, например, при вызове коменды **git log**

## *Коды Markdown*

* **(#)** Заголовок первого уровня

* **(##)** Заголовок h2

* **(###)** Заголовок h3

* **(####)** Заголовок h4

* **(#####)** Заголовок h5

* **(######)** Заголовок h6

* **(*)** и **(-)** Списки

* **Цифра с точкой** Нумерованный список

* **(>)** Цитата

* **([Текст альтернативный](ссылка "Можно задать title"))** Добавить картинку с альтернативным текстом

[Пробная картинка](image.jpg)

* **Два ~ до и после текста** Зачеркнутый текст

* **(*) или _ в начале и в конце** Это курсив

* **Две (*) или _ в начале и конце** Это жирный

## *GitHub команды*

* **git clone** скопировать репозиторий на наш диск

* **сd название папки** перейти в папку

* **git remote add origin ссылка** связывает локальный репозиторий с удаленным

* **git branch -M main** задаем основную ветку

* **git push -U origin main** даем команду отправлять изменения в удаленный файл

* **git push** отправить изменения в удаленный репозиторий

* **git pull** смерживает удаленную версию и локальную 